Revit 2026 API

# MarbleMarbleWidth Property

---

The property labeled "Vein Width" from the "Marble" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static string MarbleWidth { get; }
```
```vb
Public Shared ReadOnly Property MarbleWidth As String
	Get
```
```cpp
public:
static property String^ MarbleWidth {
	String^ get ();
}
```
```fsharp
static member MarbleWidth : string with get
```

#### Property Value

String

This property is of type "AssetPropertyDouble" within the range of "0, 1".

#### Reference

Marble Class

Autodesk.Revit.DB.Visual Namespace